target/test-classes/xml/ows/TC29699_createOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder correlationId="" type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL">
                <contact type="BILLING" language="en_GB">
                    <title>Mr</title>
                    <firstName>LINCOLN</firstName>
                    <lastName>TURNIPSEED</lastName>
                    <telephoneNumbers defaultContact="daytime">
                        <daytime>0398403850</daytime>
                        <evening>0208619999</evening>
                        <mobile>02086999990</mobile>
                    </telephoneNumbers>
                    <emailAddress>tesco.testing@hsntech.com</emailAddress>
                    <birthDate>1975-01-01</birthDate>
                </contact>
                <billingAddress>
                    <buildingIdentifier>30</buildingIdentifier>
                    <addressLine1>LUKIN STREET</addressLine1>
                    <!--<addressLine2>Address Line 2</addressLine2>:-->
                    <town>LONDON</town>
                    <country>United Kingdom</country>
                    <postcode>E10AA</postcode>
                    <ptc_abs_code>PTCABS23599440</ptc_abs_code>
                    <startDate>1980-08-08</startDate>
                </billingAddress>
                <accountDetail>
                    <username>323erere23wkwan150521170655308307@hsntech.com</username>
                    <!--<username>WinnieAutomation6</username>-->
                    <password>password1</password>
                    <securityQuestion>Mothers maiden name?</securityQuestion>
                    <securityAnswer>smith</securityAnswer>
                </accountDetail>
                <billingDetail>
                    <billGroupId>422</billGroupId>
                    <preferredNotification>SMS</preferredNotification>
                    <paymentDetail type="DD">
                        <directDebit>
                            <bankName>RGMSP8QI2</bankName>
                            <sortCode>089999</sortCode>
                            <accountNumber>66374958</accountNumber>
                            <accountName>4SGD1U5IY</accountName>
                        </directDebit>
                    </paymentDetail>
                    <billFormat>SUMMARY</billFormat>
                    <clubcardNumber>634143330730912784</clubcardNumber>
                </billingDetail>
            </account>
            <verification runCreditCheck="true" termsAndConditionsAccepted="false" refundableDepositAccepted="false" acceptAgreement="false">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345"  ipAddress="160.206.234.22" agentId="AmeeCare01" salesChannel="Care (CSA)" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <!--1 or more repetitions:-->
                <orderItem id="1" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile Ref 1"/>
                    <!--You have a CHOICE of the next 4 items at this level-->
                    <tariff productCode="NC12-1000-100">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <!--You have a CHOICE of the next 2 items at this level-->
                    <device productCode="HTC-DESIRE-XXX-99">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <imei>143219180932760</imei>
                        <serialNumber>123152436457768456784684</serialNumber>
                        <agreement provider="AGRTESCOMOBILE">
                            <number>43H1QuuZJ9</number>
                        </agreement>
                    </device>
                    <discBundle bundleGroup="STANDARDDATACAPPED" productCode="1GB-DATA-750-NC">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>CardName</cardName>
                    <cardNumber>5105105105105100</cardNumber>
                    <cardType>MA</cardType>
                    <cardExpiryDate>0130</cardExpiryDate>
                    <!--cardStartDate>0110</cardStartDate-->
                    <cvv>123</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>